src/Catalogs/ВходящиеДокументы/ВходящиеДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВходящиеДокументы</name>
  <basedOn>Catalog.ИсходящиеДокументы</basedOn>
  <basedOn>Catalog.Файлы</basedOn>
  <basedOn>Document.ВходящееПисьмо</basedOn>
  <basedOn>Document.ИсходящееПисьмо</basedOn>
  <attributes>
    <name>Адресат</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыВходящихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбращения</name>
    <type>
      <types>EnumRef.ВидыОбращенийГраждан</types>
    </type>
  </attributes>
  <attributes>
    <name>ВопросДеятельности</name>
    <type>
      <types>CatalogRef.ВопросыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрифДоступа</name>
    <type>
      <types>CatalogRef.ГрифыДоступа</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Дело</name>
    <type>
      <types>CatalogRef.ДелаХраненияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Дубликат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьАвтоматическоеДобавлениеУчастниковРабочейГруппы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Зарегистрировал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящийНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЛистов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПриложений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЭкземпляров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицоПереадресовавшего</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистовВПриложениях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.МестаХраненияДел</types>
      <types>CatalogRef.ТерриторииИПомещения</types>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураДел</name>
    <type>
      <types>CatalogRef.НоменклатураДел</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаХранение</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Переадресовавший</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Повторное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подписал</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение адресата</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>DefinedType.РегистрационныйНомер</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Создал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполненияПервоначальный</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособПолучения</name>
    <type>
      <types>CatalogRef.СпособыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <comment>Плановый срок исполнения</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокОтветаПереадресовавшему</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЗапретитьАвтоматическоеДобавлениеУчастниковРабочейГруппы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьШаблон</name>
    <type>
      <types>CatalogRef.ШаблоныВходящихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяОтветПереадресовавшему</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаДокумента</name>
    <type>
      <types>EnumRef.ВариантыФормДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧисловойНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныВходящихДокументов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВопросыОбращения</name>
    <attributes>
      <name>Вопрос</name>
      <type>
        <types>CatalogRef.ВопросыОбращений</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтвета</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>КодВопроса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОрганДляПередачи</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Раздел</name>
      <type>
        <types>CatalogRef.РазделыОбращений</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатРассмотрения</name>
      <type>
        <types>EnumRef.РезультатыРассмотренияОбращений</types>
      </type>
    </attributes>
    <attributes>
      <name>Тема</name>
      <type>
        <types>CatalogRef.ТемыОбращений</types>
      </type>
    </attributes>
    <attributes>
      <name>Тематика</name>
      <type>
        <types>CatalogRef.ТематикиОбращений</types>
      </type>
    </attributes>
    <attributes>
      <name>МнениеАвтораОРезультатах</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>МнениеАвтораОМерах</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьРезолюции</name>
    <attributes>
      <name>АвторРезолюции</name>
      <type>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРезолюции</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Резолюция</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Рассмотрение</name>
      <type>
        <types>BusinessProcessRef.Рассмотрение</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СубъектыПерсональныхДанных</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьЭлектронныеЦифровыеПодписи</name>
    <attributes>
      <name>ДатаПодписи</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайлаПодписи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>260</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КомуВыданСертификат</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>УстановившийПодпись</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <comment>Двоичные данные сертификата</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/РезультатыРассмотренияОбращений/РезультатыРассмотренияОбращений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РезультатыРассмотренияОбращений</name>
  <enumValues>
    <name>Поддержано</name>
  </enumValues>
  <enumValues>
    <name>ВТомЧислеМерыПриняты</name>
  </enumValues>
  <enumValues>
    <name>Разъяснено</name>
  </enumValues>
  <enumValues>
    <name>НеПоддержано</name>
  </enumValues>
  <enumValues>
    <name>ОставленоБезОтвета</name>
  </enumValues>
  <enumValues>
    <name>НаправленоВИнойОрган</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ВходящиеДокументы/Forms/ФормаВыбораИзКлассификатора/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Вопрос = Параметры.Вопрос;
	Раздел = Параметры.Раздел;
	Тематика = Параметры.Тематика;
	Тема = Параметры.Тема;
	Отправитель = Параметры.Отправитель;
	Документ = Параметры.Документ;
	
	КлючСохраненияПоложенияОкна = Параметры.КлючСохраненияПоложенияОкна;
	ПолучитьКодВопроса();
	
	Если Параметры.Свойство("СокращенныйРежим") И Параметры.СокращенныйРежим Тогда 
		Элементы.ГруппаРузультат.Видимость = Ложь;
	Иначе 
		
		ОрганДляПередачи = Параметры.ОрганДляПередачи;
		СопроводительныйДокументСтрока = Параметры.СопроводительныйДокументСтрока;
		СопроводительныйДокумент = Параметры.СопроводительныйДокумент;
		
		ОтветныйДокументСтрока = Параметры.ОтветныйДокументСтрока;
		ОтветныйДокумент = Параметры.ОтветныйДокумент;
		
		ДатаОтвета = Параметры.ДатаОтвета;
		РезультатРассмотрения = Параметры.РезультатРассмотрения;
		МнениеАвтораОМерах = Параметры.МнениеАвтораОМерах;
		МнениеАвтораОРезультатах = Параметры.МнениеАвтораОРезультатах;
		
		Элементы.ГруппаОрганИСопроводительныйДокумент.Видимость = Ложь;
		Элементы.ГурппаОтветныйДокумент.Видимость = Ложь;
		Элементы.ДатаОтвета.Видимость = Ложь;
		Элементы.ГруппаМнениеАвтора.Видимость = Ложь;
		
		Если РезультатРассмотрения = ПредопределенноеЗначение("Перечисление.РезультатыРассмотренияОбращений.НаправленоВИнойОрган") Тогда 
			Элементы.ГруппаОрганИСопроводительныйДокумент.Видимость = Истина;
			Если Не ЗначениеЗаполнено(ДатаОтвета) Тогда 
				ДатаОтвета = ТекущаяДата();
			КонецЕсли;
			
		ИначеЕсли РезультатРассмотрения = ПредопределенноеЗначение("Перечисление.РезультатыРассмотренияОбращений.ВТомЧислеМерыПриняты")
			Или РезультатРассмотрения = ПредопределенноеЗначение("Перечисление.РезультатыРассмотренияОбращений.НеПоддержано")
			Или РезультатРассмотрения = ПредопределенноеЗначение("Перечисление.РезультатыРассмотренияОбращений.Поддержано")
			Или РезультатРассмотрения = ПредопределенноеЗначение("Перечисление.РезультатыРассмотренияОбращений.Разъяснено") Тогда 
			Элементы.ДатаОтвета.Видимость = Истина;
			Элементы.ГруппаМнениеАвтора.Видимость = Истина;
			
			Если Не ЗначениеЗаполнено(ДатаОтвета) Тогда 
				ДатаОтвета = ТекущаяДата();
			КонецЕсли;
			
			Если РезультатРассмотрения = ПредопределенноеЗначение("Перечисление.РезультатыРассмотренияОбращений.ВТомЧислеМерыПриняты")
				Или РезультатРассмотрения = ПредопределенноеЗначение("Перечисление.РезультатыРассмотренияОбращений.Поддержано")
				Или РезультатРассмотрения = ПредопределенноеЗначение("Перечисление.РезультатыРассмотренияОбращений.Разъяснено") Тогда 
				Элементы.ГурппаОтветныйДокумент.Видимость = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("Заголовок") И ЗначениеЗаполнено(Параметры.Заголовок) Тогда 
		Заголовок = Параметры.Заголовок;
		АвтоЗаголовок = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не (ЗначениеЗаполнено(Раздел) И ЗначениеЗаполнено(Тема)
		 И ЗначениеЗаполнено(Тематика) И ЗначениеЗаполнено(Вопрос)) Тогда 
		ПодключитьОбработчикОжидания("ЗапуститьВыборКода", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Работа с кодом вопроса
&НаКлиенте
Процедура КодВопросаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Раздел", Раздел);
	ПараметрыФормы.Вставить("Тематика", Тематика);
	ПараметрыФормы.Вставить("Тема", Тема);
	ПараметрыФормы.Вставить("Вопрос", Вопрос);
	ПараметрыФормы.Вставить("КодВопроса", КодВопроса);
	ПараметрыФормы.Вставить("СокращенныйРежим", Истина);
	ПараметрыФормы.Вставить("КлючСохраненияПоложенияОкна", "ВыборОдногоВопроса");
	
	Обработчик = Новый ОписаниеОповещения("КодВопросаПослеВыбора", 
		ЭтотОбъект);
		
	ОткрытьФорму("ОбщаяФорма.ПомощникВыбораВопроса", ПараметрыФормы, , , , ,
		Обработчик, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура КодВопросаПослеВыбора(Результат, Параметры) Экспорт 
	
	Если Результат <> Неопределено Тогда 
		Раздел = Результат.Раздел;
		Тематика = Результат.Тематика;
		Тема = Результат.Тема;
		Вопрос = Результат.Вопрос;
		КодВопроса = Результат.КодВопроса;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КодВопросаОчистка(Элемент, СтандартнаяОбработка)
	
	Раздел = Неопределено;
	Тематика = Неопределено;
	Тема = Неопределено;
	Вопрос = Неопределено;
	КодВопроса = "";
	
КонецПроцедуры

&НаКлиенте
Процедура РазделПриИзменении(Элемент)
	
	ПолучитьКодВопроса();
	
КонецПроцедуры

&НаКлиенте
Процедура ТемаПриИзменении(Элемент)
	
	ПолучитьКодВопроса();
	
КонецПроцедуры

&НаКлиенте
Процедура ТематикаПриИзменении(Элемент)
	
	ПолучитьКодВопроса();
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПриИзменении(Элемент)
	
	ПолучитьКодВопроса();
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатРассмотренияПриИзменении(Элемент)
	
	Элементы.ГруппаОрганИСопроводительныйДокумент.Видимость = Ложь;
	Элементы.ДатаОтвета.Видимость = Ложь;
	Элементы.ГруппаМнениеАвтора.Видимость = Ложь;
	Элементы.ГурппаОтветныйДокумент.Видимость = Ложь;
	
	Если РезультатРассмотрения = ПредопределенноеЗначение("Перечисление.РезультатыРассмотренияОбращений.НаправленоВИнойОрган") Тогда 
		Элементы.ГруппаОрганИСопроводительныйДокумент.Видимость = Истина;
		ОтветныйДокумент = Неопределено;
		
	ИначеЕсли РезультатРассмотрения = ПредопределенноеЗначение("Перечисление.РезультатыРассмотренияОбращений.ВТомЧислеМерыПриняты")
		Или РезультатРассмотрения = ПредопределенноеЗначение("Перечисление.РезультатыРассмотренияОбращений.НеПоддержано")
		Или РезультатРассмотрения = ПредопределенноеЗначение("Перечисление.РезультатыРассмотренияОбращений.Поддержано")
		Или РезультатРассмотрения = ПредопределенноеЗначение("Перечисление.РезультатыРассмотренияОбращений.Разъяснено") Тогда 
		Элементы.ДатаОтвета.Видимость = Истина;
		Элементы.ГруппаМнениеАвтора.Видимость = Истина;
		
		Если Не ЗначениеЗаполнено(ДатаОтвета) Тогда 
			ДатаОтвета = ТекущаяДата();
		КонецЕсли;
		
		Если РезультатРассмотрения = ПредопределенноеЗначение("Перечисление.РезультатыРассмотренияОбращений.ВТомЧислеМерыПриняты")
			Или РезультатРассмотрения = ПредопределенноеЗначение("Перечисление.РезультатыРассмотренияОбращений.Поддержано")
			Или РезультатРассмотрения = ПредопределенноеЗначение("Перечисление.РезультатыРассмотренияОбращений.Разъяснено") Тогда 
			Элементы.ГурппаОтветныйДокумент.Видимость = Истина;
		Иначе 
			ОтветныйДокумент = Неопределено;
		КонецЕсли;
		
		СопроводительныйДокумент = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МнениеАвтораОРезультатахНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Комментарий", МнениеАвтораОРезультатах);
	ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Мнение заявителя о результатах'"));
	ОписаниеОповещения = Новый ОписаниеОповещения("ВводКомментарияМнениеАвтораОРезультатахЗавершение", ЭтотОбъект);
	РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	
	ОткрытьФорму("ОбщаяФорма.ВводКомментария", ПараметрыФормы,,,,, ОписаниеОповещения, РежимОткрытияОкна);
	
КонецПроцедуры

&НаКлиенте
Процедура ВводКомментарияМнениеАвтораОРезультатахЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Строка") Тогда
		Возврат;
	КонецЕсли;
	
	МнениеАвтораОРезультатах = Результат;
	
КонецПроцедуры

&НаКлиенте
Процедура МнениеАвтораОМерахНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Комментарий", МнениеАвтораОМерах);
	ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Мнение заявителя о мерах'"));
	ОписаниеОповещения = Новый ОписаниеОповещения("ВводКомментарияМнениеАвтораОМерахЗавершение", ЭтотОбъект);
	РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	
	ОткрытьФорму("ОбщаяФорма.ВводКомментария", ПараметрыФормы,,,,, ОписаниеОповещения, РежимОткрытияОкна);
	
КонецПроцедуры

&НаКлиенте
Процедура ВводКомментарияМнениеАвтораОМерахЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Строка") Тогда
		Возврат;
	КонецЕсли;
	
	МнениеАвтораОМерах = Результат;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганДляПередачиПриИзменении(Элемент)
	
	СопроводительныйДокумент = Неопределено;
	СопроводительныйДокументСтрока = Неопределено;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Работа с "Сопроводительный документ"

&НаКлиенте
Процедура СопроводительныйДокументСтрокаПриИзменении(Элемент)
	
	РаботаСОбращениямиКлиент.СопроводительныйДокументПриИзменении(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СопроводительныйДокументСтрокаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСОбращениямиКлиент.СопроводительныйДокументНачалоВыбора(
		ЭтаФорма, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СопроводительныйДокументСтрокаОчистка(Элемент, СтандартнаяОбработка)
	
	РаботаСОбращениямиКлиент.СопроводительныйДокументОчистка(
		ЭтаФорма, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СопроводительныйДокументСтрокаОткрытие(Элемент, СтандартнаяОбработка)
	
	РаботаСОбращениямиКлиент.СопроводительныйДокументОткрытие(
		ЭтаФорма, Элемент, СтандартнаяОбработка); 
	
КонецПроцедуры

&НаКлиенте
Процедура СопроводительныйДокументСтрокаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСОбращениямиКлиент.СопроводительныйДокументОбработкаВыбора(
		ЭтаФорма, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СопроводительныйДокументСтрокаАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	РаботаСОбращениямиКлиент.СопроводительныйДокументАвтоПодбор(
		ЭтаФорма, Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СопроводительныйДокументСтрокаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСОбращениямиКлиент.СопроводительныйДокументОкончаниеВводаТекста(
		ЭтаФорма, Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Работа с "Ответный документ"

&НаКлиенте
Процедура ОтветныйДокументСтрокаПриИзменении(Элемент)
	
	РаботаСОбращениямиКлиент.ОтветныйДокументПриИзменении(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветныйДокументСтрокаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСОбращениямиКлиент.ОтветныйДокументНачалоВыбора(
		ЭтаФорма, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветныйДокументСтрокаОчистка(Элемент, СтандартнаяОбработка)
	
	РаботаСОбращениямиКлиент.ОтветныйДокументОчистка(
		ЭтаФорма, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветныйДокументСтрокаОткрытие(Элемент, СтандартнаяОбработка)
	
	РаботаСОбращениямиКлиент.ОтветныйДокументОткрытие(
		ЭтаФорма, Элемент, СтандартнаяОбработка); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветныйДокументСтрокаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСОбращениямиКлиент.ОтветныйДокументОбработкаВыбора(
		ЭтаФорма, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветныйДокументСтрокаАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	РаботаСОбращениямиКлиент.ОтветныйДокументАвтоПодбор(
		ЭтаФорма, Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветныйДокументСтрокаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСОбращениямиКлиент.ОтветныйДокументОкончаниеВводаТекста(
		ЭтаФорма, Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("Раздел", Раздел);
	ПараметрыЗакрытия.Вставить("Тематика", Тематика);
	ПараметрыЗакрытия.Вставить("Тема", Тема);
	ПараметрыЗакрытия.Вставить("Вопрос", Вопрос);
	ПараметрыЗакрытия.Вставить("КодВопроса", КодВопроса);
	
	ПараметрыЗакрытия.Вставить("РезультатРассмотрения", РезультатРассмотрения);
	ПараметрыЗакрытия.Вставить("ДатаОтвета", ДатаОтвета);
	ПараметрыЗакрытия.Вставить("ОрганДляПередачи", ОрганДляПередачи);
	ПараметрыЗакрытия.Вставить("СопроводительныйДокументСтрока", СопроводительныйДокументСтрока);
	ПараметрыЗакрытия.Вставить("СопроводительныйДокумент", СопроводительныйДокумент);
	ПараметрыЗакрытия.Вставить("ОтветныйДокументСтрока", ОтветныйДокументСтрока);
	ПараметрыЗакрытия.Вставить("ОтветныйДокумент", ОтветныйДокумент);
	ПараметрыЗакрытия.Вставить("МнениеАвтораОМерах", МнениеАвтораОМерах);
	ПараметрыЗакрытия.Вставить("МнениеАвтораОРезультатах", МнениеАвтораОРезультатах);
	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗапуститьВыборКода()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Раздел", Раздел);
	ПараметрыФормы.Вставить("Тематика", Тематика);
	ПараметрыФормы.Вставить("Тема", Тема);
	ПараметрыФормы.Вставить("Вопрос", Вопрос);
	ПараметрыФормы.Вставить("КодВопроса", КодВопроса);
	ПараметрыФормы.Вставить("СокращенныйРежим", Истина);
	ПараметрыФормы.Вставить("КлючСохраненияПоложенияОкна", "ВыборОдногоВопроса");
	
	Обработчик = Новый ОписаниеОповещения("КодВопросаПослеВыбора", 
		ЭтотОбъект);
		
	ОткрытьФорму("ОбщаяФорма.ПомощникВыбораВопроса", ПараметрыФормы, , , , ,
		Обработчик, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьКодВопроса()
	
	КодВопроса = РаботаСОбращениямиВызовСервера.СформироватьКодВопроса(Раздел, Тематика, Тема, Вопрос);
	
КонецПроцедуры

#КонецОбласти
